app/Http/Controllers/Backend/AdminController.php

    public function create()
    {
        $roles = Role::where('id','!=', 1)
            ->orderBy('name')
            ->pluck('name', 'id');
---
select `name`, `id` from `roles` where `id` != 1 order by `name` asc

    public function store(StoreOrUpdateAdminRequest $request)
    {
        Admin::create([
            'role_id' => $request->role_id,
            'name' => $request->name,
            'email' => $request->email,
            'password' => Hash::make($request->password),
            'is_active' => $request->is_active
        ]);
---
insert into `admins` (`role_id`, `name`, `email`, `password`, `is_active`, `updated_at`, `created_at`) values ('2', 'Adminpp', 'adminpp@gmail.com', '$2y$10$R91K5t9Dj8eUZO8.Z67mEurHFOV2m0WllSjWvwoyHLrApwVV46TYC', '1', '2022-08-17 04:01:38', '2022-08-17 04:01:38')

    public function updateActiveStatus($id, Request $request)
    {
        $admin = Admin::findOrFail($id);
        $admin->update(['is_active' => $request->is_active]);
---
select * from `admins` where `admins`.`id` = '2' and `admins`.`deleted_at` is null limit 1
update `admins` set `is_active` = 1, `admins`.`updated_at` = '2022-08-17 04:01:50' where `id` = 2