app/Http/Controllers/Backend/BackendController.php

    public function index()
    {
        $totalAdmins = Admin::where('role_id','!=',1)->count();
        $totalUsers = User::count();
        $totalVendors = Vendor::count();
---
select count(*) as aggregate from `admins` where `role_id` != 1 and `admins`.`deleted_at` is null
select count(*) as aggregate from `users` where `users`.`deleted_at` is null
select count(*) as aggregate from `vendors` where `vendors`.`deleted_at` is null