app/Http/Controllers/Backend/UserController.php

select * from `users` where `users`.`deleted_at` is null order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `users` where `users`.`deleted_at` is null
---
    public function index()
    {
        $users = User::latest()
            ->paginate($this->perPage);

insert into `users` (`name`, `phone`, `email`, `image`, `activation_code`, `register_source`, `testing_status`, `is_active`, `token`, `last_login`, `updated_at`, `created_at`) values ('Usera', '09979156080', 'usera@gmail.com', 'hX6xgHIVp8.jpg', '', 'panel', '0', '1', '', '2022-08-17 04:02:58', '2022-08-17 04:02:58', '2022-08-17 04:02:58')
insert into `user_addresses` (`user_id`, `address`, `phone`, `type`, `lat`, `lng`, `loc_name`, `updated_at`, `created_at`) values (1, 'No(21),Fouth Floor, ThuuWaNa  Street, Kyaik Ka San Qrt, SanchaungTownship, Yangon', '09979824552', 'Office', '234', '35', '43', '2022-08-17 04:02:58', '2022-08-17 04:02:58')
---
    public function store(StoreOrUpdateUserRequest $request)
    {
        //vendor image
        $image = $request->file('image');
        $name = Str::random(10).'.'.$image->extension();
        $image->move(public_path().'/images/user_images/', $name);
        $image=$name;

        $user = User::create([
                'name' => $request->name,
                'phone' => $request->phone,
                'email' => $request->email,
                'image' => $image,
                'activation_code' => "",
                'register_source' => "panel",
                'testing_status' => $request->testing_status,
                'is_active' => $request->is_active,
                'token' => "",
                'last_login' => now(),
            ]);

        $totalAddress = count($request->address);

        for($i=0; $i < $totalAddress; $i++){
            UserAddress::create([
                'user_id' => $user->id,
                'address' => $request->input('address.' . $i),
                'phone' => $request->input('address_phone.' . $i),
                'type'  => $request->input('type.' . $i),
                'lat'   => $request->input('lat.' . $i),
                'lng'   => $request->input('lng.' . $i),
                'loc_name' => $request->input('loc_name.' . $i)
            ]);

select * from `users` where `users`.`id` = '1' and `users`.`deleted_at` is null limit 1
select * from `user_addresses` where `user_id` = '1'
---
    public function edit($id)
    {
        $user = User::findOrFail($id);
        $userAddresses = UserAddress::where('user_id',$id)->get();