app/Http/Controllers/Backend/VendorController.php

    public function index()
    {
        $vendors = Vendor::latest()
                ->paginate($this->perPage);
---
select * from `vendors` where `vendors`.`deleted_at` is null order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `vendors` where `vendors`.`deleted_at` is null

    public function store(StoreOrUpdateVendorRequest $request)
    {
        //attached files
        $attached_files = $request->file('attached_files');
        $images = array();

        foreach($attached_files as $file){
            $name = Str::random(10).'.'.$file->extension();
            $file->move(public_path().'/images/attached_files/', $name);
            $images[]=$name;
        }

        //vendor image
        $image = $request->file('image');
        $name = Str::random(10).'.'.$image->extension();
        $image->move(public_path().'/images/vendor_images/', $name);
        $image=$name;

        Vendor::create([
            'name' => $request->name,
            'phone' => $request->phone,
            'address' => $request->address,
            'image' => $image,
            'join_date' => $request->join_date,
            'permanent_date' => $request->permanent_date,
            'attached_files' => json_encode($images),
            'is_active' => $request->is_active,
        ]);
---
insert into `vendors` (`name`, `phone`, `address`, `image`, `join_date`, `permanent_date`, `attached_files`, `is_active`, `updated_at`, `created_at`) values ('Vendora', '09694246313', 'No(21) 6th floor (A), Kamayut, Insein Township', 'tm02myffZT.jpg', '2022-08-19', '2022-08-20', '[\"amVVYkqbqG.jpg\"]', '0', '2022-08-17 04:03:43', '2022-08-17 04:03:43')

    public function destroy($id)
    {
        $vendor = Vendor::findOrFail($id);

        $image = public_path("images/vendor_images/").$vendor->image;

        if(file_exists($image)){
            @unlink($image);
        }

        $hidden_attached_files = json_decode($vendor->attached_files);

        foreach($hidden_attached_files as $hidden_attached_file){
            $photo = public_path("images/attached_files/").$hidden_attached_file;

            if(file_exists($photo)){
                @unlink($photo);
            }
        }

        $vendor->delete();
---
select * from `vendors` where `vendors`.`id` = '1' and `vendors`.`deleted_at` is null limit 1
update `vendors` set `deleted_at` = '2022-08-17 04:04:59', `vendors`.`updated_at` = '2022-08-17 04:04:59' where `id` = 1